In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\thall\anaconda3\lib\site-packages (1.3.4)
Requirement already satisfied: pytz>=2017.3 in c:\users\thall\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.17.3 in c:\users\thall\anaconda3\lib\site-packages (from pandas) (1.20.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\thall\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\thall\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
df=pd.DataFrame()

In [5]:
name=['a','b','c']
city=['x','y','z']
n={'Name1':name, 'city':city}

In [6]:
i=['R1','R2','R3']

In [9]:
df=pd.DataFrame(n)

In [10]:
df

  Name1 city
0     a    x
1     b    y
2     c    z

# for adding index reference

In [11]:
df=pd.DataFrame(n,index=i)

In [12]:
df

   Name1 city
R1     a    x
R2     b    y
R3     c    z

# for output of only one column of above dataframe

In [13]:
df.Name1

R1    a
R2    b
R3    c
Name: Name1, dtype: object

# if we need to add extra column of anything extra data like age / literacy %

In [14]:
age=[40,25,90]

In [15]:
df['age']=age

In [16]:
df

   Name1 city  age
R1     a    x   40
R2     b    y   25
R3     c    z   90

# for delete any data

In [17]:
del df['age']

In [18]:
df

   Name1 city
R1     a    x
R2     b    y
R3     c    z

# creating any random datga for creating of dictionary

In [19]:
r= np.random.randint(low=1,high=100,size=10)

In [20]:
n= np.random.choice(['A','B','C','D','E','F'],size=10)

In [21]:
c= np.random.choice([40,5,45,56,7,55,0,55,66,0,55,66,1],size=10)

In [22]:
dict1={'x':r,'y':n, 'z':c}

In [23]:
df=pd.DataFrame(dict1)

In [24]:
df

    x  y   z
0  52  D   0
1  93  F  45
2  98  B   5
3  58  B  55
4  83  C  55
5  47  D   1
6  14  A  56
7  29  B   1
8  15  A  55
9  83  D  55

In [27]:
df.head(1)

    x  y  z
0  52  D  0

In [28]:
df.tail()

    x  y   z
5  47  D   1
6  14  A  56
7  29  B   1
8  15  A  55
9  83  D  55

In [29]:
df.describe()

               x          z
count  10.000000  10.000000
mean   57.200000  32.800000
std    31.360981  26.935313
min    14.000000   0.000000
25%    33.500000   2.000000
50%    55.000000  50.000000
75%    83.000000  55.000000
max    98.000000  56.000000